app/views/posts/_form.html.erb

    <div>
      <%= collection_check_boxes(:post, :category_ids, Category.all, :id, :name) do |b| %>
---
SELECT "categories".* FROM "categories"