app/views/posts/_post.html.erb

    </p>
    <small><span><%= link_to("#{post.comments.size} comments", post_path(post)) %></span></small>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]