app/views/posts/show.html.erb

<h5>Comments:</h5>
<% @post.reload.comments.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]