app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'apple' LIMIT 1
---
  def show
    @category = Category.find_by(slug: params[:id])

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Tue, 02 Jan 2018 15:12:02 UTC +00:00], ["name", "Basketball"], ["updated_at", Tue, 02 Jan 2018 15:12:02 UTC +00:00]]
---
  def create
    @category = Category.new(params.require(:category).permit(:name))

    if @category.save