app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'xerox-was-amazing!' LIMIT 1
---
  def create
    @comment = Comment.new(params.require(:comment).permit(:body))
    @post = Post.find_by(slug: params[:post_id])

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "4"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 13 Jan 2018 07:57:42 UTC +00:00], ["updated_at", Sat, 13 Jan 2018 07:57:42 UTC +00:00], ["user_id", 2], ["vote", true], ["voteable_id", 4], ["voteable_type", "Comment"]]
---
  def vote
    @comment = Comment.find(params[:id])
    @vote = Vote.create(voteable: @comment, user: current_user, vote: params[:vote])