app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "newest test"], ["created_at", Tue, 02 Jan 2018 17:51:03 UTC +00:00], ["post_id", 1], ["updated_at", Tue, 02 Jan 2018 17:51:03 UTC +00:00], ["user_id", 1]]
---
  def create
    @comment = Comment.new(params.require(:comment).permit(:body))
    @post = Post.find(params[:post_id])
    @comment.post = @post
    # tempfix - no user login system yet
    @comment.user = User.first

    if @comment.save