app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)
    # Temp fix - TODO - change once we have authentification set up
    @post.user = User.first

    if @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 02 Jan 2018 19:43:37 UTC +00:00], ["description", ""], ["title", "Testing"], ["updated_at", Tue, 02 Jan 2018 19:43:37 UTC +00:00], ["url", ""], ["user_id", 1]]

  def update
    if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = 5  [["title", "The iPod revolutionized music"], ["description", "Everyone knows this"], ["updated_at", Tue, 02 Jan 2018 19:52:55 UTC +00:00]]

  def set_post
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."id" ASC LIMIT 1  [["id", 1]]