app/controllers/posts_controller.rb

  def vote
    @vote = Vote.create(voteable: @post, user: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 13 Jan 2018 07:34:55 UTC +00:00], ["updated_at", Sat, 13 Jan 2018 07:34:55 UTC +00:00], ["user_id", 2], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]

  def set_post
    @post = Post.find_by(slug: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = 'windows-95-was-revolutionary!' LIMIT 1